#include <iostream>
using namespace std;

int task_9_3() {
    unsigned int N;
    cout << "Введіть натуральне число від 0 до 21359010: ";
    cin >> N;

    int count = 0; // змінна для підрахунку кількості бінарних 0 або 1

    if ((N >> 11) & 1) { // перевіряємо біт D11 числа N
        while (N) {
            count += N & 1 ? 0 : 1; // якщо біт 0, збільшуємо лічильник
            N >>= 1; // зсуваємо число N на 1 біт вправо
        }
    } else {
        while (N) {
            count += N & 1 ? 1 : 0; // якщо біт 1, збільшуємо лічильник
            N >>= 1; // зсуваємо число N на 1 біт вправо
        }
    }

    cout << "Кількість " << (count ? "одиниць" : "нулів") << ": " << count << endl;

    return 0;
}
