#include <iostream> // Директивою підключення заголовочного файлу, яка дозволяє використовувати стандартний ввід та вивід даних на консоль.
#include <windows.h> // Директива підключення заголовочного файлу, яка дозволяє використовувати функції та інші елементи API операційної системи Windows.
#include <cmath>  //Включає заголовочний файл для роботи з математичними функціями.
#include "ModulesParashchenko.h" // Підключаємо заголовочний файл з функціями.
#include "s_calculation.h" // Підключаємо заголовочний файл з функціями.

using namespace std; //Директива імпорту простору імен. Ця директива дозволяє використовувати ідентифікатори з простору імен std (стандартна бібліотека С++) без префіксу "std::".

int main() {
SetConsoleOutputCP(1251); // Директива підключення заголовочного файлу, яка дозволяє використовувати функції та інші елементи API операційної системи Windows.
SetConsoleCP(1251); //Ця функція встановлює кодову сторінку (code page) консолі Windows для зчитування символів у відповідності з кирилицею (CP1251).

double x, z, S;
int a, b;

// Введення значень змінних x, z, a та b.
cout << "Введіть значення x: ";
cin >> x;

cout << "Введіть значення z: ";
cin >> z;

cout << "Введіть символ a: ";
cin >> a;

cout << "Введіть символ b: ";
cin >> b;

// Викликаємо функції для виконання підзадач та виводимо результат у вихідний потік.
cout << "Розробник програми: " << author_name() << " ©" << endl;
cout << "Результат виразу a+1>|b-2|: " << boolalpha << expression_result(a, b) << endl;
cout << "Значення x: " << x << " (0x" << hex << (int)x << ")" << endl;
cout << "Значення z: " << z << " (0x" << hex << (int)z << ")" << endl;
S = s_calculation(x, z);
cout << "Значення виразу S: " << S << endl;

return 0;
}
